label charaHappyEnding(forcePlay = False):

    if builditTesting and (not forcePlay):
        return

    주인공 "카라. 나와 지구로 가 주겠어?"
    카라 "좋아."
    수나 "둘의 행복을 비마. 그럼 후작, 마법진 안에 서도록."

    독백 "수나의 앞에 무릎을 꿇었다."
    주인공 "수나 공주님. 함께 해서 영광이었습니다."
    주인공 "부디 원하시는 발전을 이루시길."
    수나 "이제야 후작이 제대로 예의를 갖추는구나."
    수나 "그간 고마웠느니라, 후작. 잘 가거라."

    독백 "별천지로 올 때처럼 거대한 힘이 내 몸을 끌어당긴다."

    독백 "눈을 떠 보니 내 자취방 앞이었다. 문도 그대로 열려 있었다."
    독백 "이크. 지금 바로 나가지 않으면 지각하겠다. 즉시 학교로 뛰었다."

    # 학교 건물 fadein
    scene college with fadeoutin
    pause 3.

    # 자취방 복도 fadein
    scene college with fadeoutin

    독백 "수업이 끝났다."
    독백 "별천지에서 있었던 일이 꿈만 같다. 아니, 정말 꿈이었나?"
    독백 "집으로 가려 학교 건물을 나왔다."

    scene chara_street with dissolve
    카라 "여기 있었구나."
    주인공 "카라!"
    주인공 "내내 기다렸어? 나를 찾아오지."
    카라 "느긋하게 움직이고 싶었지."
    카라 "여성들 복장을 의태해 봤는데, 어때?"
    주인공 "예쁘고 잘 어울려."
    주인공 "우선 뭐 좀 먹을까?"
    카라 "좋지. 지구의 음식은 어떨지 궁금하네."

    독백 "학교 앞의 제과점으로 들어갔다."
    주인공 "저기 앉자."
    카라 "응."
    독백 "카라는 슬라임 형상으로 변해 그대로 파티션을 통과했다."
    주인공 "으힉! 조심해."
    카라 "뭘?"
    주인공 "여기는 돌아서 들어가 앉아야지."
    카라 "바로 질러서 통과할 수 있는데 왜 그래야 해?"
    주인공 "돌아서 가야 한다니까. 그게 상식이야."
    카라 "그러니까 왜?"
    주인공 "그냥 날 믿어. 여기는 지구니까 지구의 상식을 따라야지."
    카라 "납득은 안 되지만……. 그렇다니까 일단 따르지."

    독백 "빵과 과자를 몇 개 집어서 카라의 맞은편에 앉았다."
    카라 "이게 지구의 음식이구나. 모양이 꽤 예쁘네."
    주인공 "응. 밀푀유라는 과자야. 한 번 먹어 봐."
    카라 "흠……. 몸에 넣으면 녹아 없어질 과자도 이렇게 예술적으로 만들다니……."
    카라 "지구인들은 참 할 일 없는 족속들이구나?"
    주인공 "뭐라고?"
    카라 "그렇잖아. 뱃속에 들어가면 다 똑같은데 모양 따위가 무슨 상관이야?"
    주인공 "야, 야. 만드신 분들 들으면 서운하겠다. 더 예쁘고 맛있는 음식을 먹고 싶어하는 마음은 누구나 똑같다고."
    카라 "그런가? 나는 이해가 안 돼."
    주인공 "카라. 이런 말 하기는 미안하지만……."
    독백 "무언가 아부를 해 볼 시간이다."
    주인공 "네 본질은 효모지?"
    카라 "응."
    주인공 "그런데 왜 그렇게 예쁜 외형을 취하고 있어?"
    카라 "내 외형이 예뻐?"
    주인공 "응."
    카라 "뭐, 나쁜 기분은 아니네."
    주인공 "그것 봐. 어차피 사라져 버릴 말도 예쁘게 하면 상대방이 기분 좋잖아?"
    주인공 "비슷한 거야."
    카라 "이해가 될 듯 말 듯 하네. 그럼 예쁜 과자는 어떤지 맛을 볼까?"
    독백 "카라는 슬라임 형상으로 변해 밀푀유를 접시째 가슴 속에 쑤셔넣었다."
    주인공 "으힉! 또?"
    카라 "음, 달다. 당분이 몸 속으로 스며드는구나."
    카라 "지구의 음식은 이런 느낌이구나. 바삭바삭하고 촉촉하네."
    독백 "카라는 빈 접시를 가슴에서 꺼냈다."
    주인공 "손으로 집어서 입으로 먹어."
    카라 "음식 하나 먹는데 이렇게까지 신경써야 해?"

    독백 "두 번째 과자는 얌전히 손으로 집어서 먹는군."
    카라 "입으로만 먹으려니 감질나."
    독백 "카라는 둘로 분열하더니 과자를 하나씩 집어들었다."
    카라 "이러면 두 배로 먹을 수 있지."
    주인공 "아니, 아니! 그만. 아무데서나 능력 발휘하지 말라고."
    카라 "하아……. 지구인으로 산다는 건 참 복잡하군."
    독백 "도로 한 몸으로 합쳐진 카라. 주변에서 웅성거리는 소리가 들린다."
    독백 "잽싸게 일어나서 꾸벅거리며 사과했다."
    주인공 "여러분! 죄송합니다. 영화 '털민웨이터 2 - 슬라임의 날'을 촬영하던 중이었습니다."
    주인공 "인공지능 컴퓨터 그래픽을 실시간으로 현실에 합성하는 장면이었습니다. 기대해 주세요!"

    scene chara_street with dissolve
    독백 "카라의 손목을 잡고 재빨리 제과점 밖으로 나왔다."
    카라 "뭐야? 반도 못 먹었는데."
    독백 "왠지 앞날이 험난할 듯한 느낌인데……."
    주인공 "우선은 집으로 가자. 집에서 천천히 먹는 게 좋겠어."

    scene chara_sex1 with fadeoutin
    독백 "카라와 함께 집으로 와 밥을 먹고 사랑을 나누었다."
    카라 "당신을 따라 지구로 오길 잘 한 것 같아."
    카라 "이렇게 다양한 맛을 볼 수 있다니."
    주인공 "기대해도 좋아. 지구인들 중에는 먹는 데 목숨 건 사람도 많거든."
    주인공 "그럼 좀 씻을까?"
    카라 "내가 먼저 씻을게. 누워 있어."
    주인공 "응. 여기서 씻으면 돼."

    독백 "카라를 화장실로 안내했다."
    독백 "그런데 들어가고 한참 지나도 물 소리가 안 들린다."
    독백 "뭐지? 수도꼭지 트는 방법을 안 가르쳐 줘서 그런가?"
    주인공 "카라. 들려? 들어가도 돼?"
    독백 "대답이 없다. 계속 조용해서 화장실로 들어가 보았다."
    주인공 "어?"
    독백 "카라가 없다."
    주인공 "카라?"
    독백 "그 때 하수구에서 슬라임 손이 불쑥 튀어나왔다."
    주인공 "힉!"
    독백 "카라가 하수구에서 기어나온다."
    독백 "무슨 사X코냐?"

    scene chara_shower
    카라 "후후……. 여긴 먹을 게 진짜 많네."
    카라 "이 관 속에도 영양분이 잔뜩 끼어 있더라. 그걸 먹느라 좀 걸렸어."
    주인공 "맙소사. 그럼 하수관 속에 있던 쓰레기도 다 먹었단 말이야?"
    독백 "시험삼아 변기 물을 내려 보자 시원하게 쭉쭉 내려간다."
    독백 "그러고 보니 화장실 벽에 끼어 있던 물때도 말끔히 없어졌다."
    카라 "역시, 뭔가 쌓여 있는 걸 보면 답답해. 깔끔하게 먹어치워 줘야지."
    주인공 "지금은 우선 씻자."
    카라 "그러자."
    독백 "카라가 내 목을 끌어안았다."
    독백 "왠지 카라와 함께 있으면 할 수 있는 일이 무궁무진하게 늘어날 듯한 느낌이다."
    "(엔딩 크레딧)"

    return
