label charaEp01Discourtesy(forcePlay = False):

    if builditTesting and (not forcePlay):
        return

    # 카라
    독백 "오늘은 집사 업무가 일찍 끝났다. 과외도 쉬는 날이다."
    독백 "산책 삼아서 영지를 둘러볼까?"

    scene chara_1stmeet with dissolve
    독백 "카라로군."
    카라 "어? 후작. 당신이 여긴 웬일이야?"
    주인공 "그냥 한 바퀴 둘러보고 있었어."
    카라 "그렇군. 나는 하던 일이 있어서."
    독백 "카라는 쓰레기통풀의 뚜껑을 열고 작은 슬라임 하나를 떨궈 넣었다."
    주인공 "뭐 하는지 물어 봐도 돼?"
    카라 "내 분체를 투입하고 있지."
    카라 "영민들이 버린 쓰레기며 똥오줌을 분해하고 남아 있는 영양분을 철저히 흡수하는 일이야."
    카라 "그러면 맑은 물과 회분만 남지. 회분은 다시 말리의 뿌리 옆에 묻어서 거름으로 활용해."
    카라 "아, 잠깐."
    독백 "카라는 길거리에 굴러다니던 쓰레기 하나를 집어서 그대로 삼켰다."
    주인공 "어? 그걸 먹어?"
    카라 "그럼. 이것도 훌륭한 영양분인걸."
    주인공 "이런. 너도 참 불쌍하다."
    카라 "그게 무슨 말이야?"
    주인공 "남들이 버린 쓰레기를 먹고 산다는 말이잖아. 그런……."

    카라 "이봐, 후작!"
    독백 "카라의 표정이 날카로워졌다."
    카라 "하루라도 내가 없으면 어떻게 될지 상상이나 해 봤어?"
    주인공 "카라?"
    카라 "오줌이며 생똥이 길거리에 널려 있고, 쓰레기는 산을 이룰걸?"
    카라 "거기에 벌레는 얼마나 꼬일지, 그리고 냄새는 어떨지 상상이 돼?"
    주인공 "……."

    카라 "당신이 지구에서 얼마나 고상하고 깔끔하게 살았는지는 모르겠어. 내 알 바도 아니고……."
    카라 "하지만, 당신의 짧은 경험만으로 남의 일을 함부로 판단하지 마."
    카라 "나는 그저 내 본분을 다 할 뿐이니까."
    독백 "뭐라 할 말이 없다."
    카라 "공주님께서 당신을 중히 쓰셨으니 이번 일은 더 문제삼진 않겠어."
    카라 "그렇지만, 당신이 얼마나 큰 무례를 저질렀는지는 똑똑히 자각해 줘."
    독백 "그 말을 남긴 카라는 몸을 홱 돌려 숲길 사이로 걸어가 버렸다."

    return
