label rosalid_01_booting:
    scene black
    "인공지능이 탑재된 노트북이라는 기계를 책상 위에 놓고 말을 걸어 보았다."

    나 "로잘린드. 이렇게 부르면 되나?"
    로잘린드 "반갑습니다, 주인님."
    로잘린드 "저는 핵심 자료 접근과 갱신을 허락받은 인공지능입니다."
    로잘린드 "모델명 핵.허. 코드네임 로잘린드입니다."
    로잘린드 "주인님을 모실 수 있어 영광입니다."
    나 "내 인간계 신분을 만들어 줘."
    로잘린드 "정부 자료를 갱신해 주인님의 신분을 만들었습니다."
    로잘린드 "2주일 후, 주민센터에서 신규 신분증을 발급받으실 수 있습니다."

    "(터미네이터 자세로 나타나는 로잘린드)"

    scene rosalind_booting with dissolve
    로잘린드 "주신께서 주인님을 보좌하고 조언하라며 제게 영혼을 부여하셨습니다."
    로잘린드 "인공지능 유기체 로잘린드, 앞으로 브리트라 님을 주인으로 모십니다."

    return