label rosalindEp02Programming(forcePlay = False):

    if builditTesting and (not forcePlay):
        return
    
    # 저녁 먹은 후 주인공을 말똥말똥 쳐다보는 로잘린드
    # 무언가 원하는 게 있느냐고 묻는 주인공
    # 주인공에게 프로그래밍을 배우는 로잘린드
    # 스스로 목표 설정하기를 두려워함

    scene rosalind_programming with dissolve

    독백 "오늘의 영지 관리 작업을 정리했다."
    독백 "로잘린드는 내 옆에 딱 붙어서 노트북 기능을 켜 주고 있었다."

    로잘린드 "주인님. 매번 기초 기능을 조합하여 새로운 기능을 만들어내는 것이 흥미롭군요."
    주인공 "프로그래밍 말하는 거야? 그래, 마치 문제를 푸는 것 같지."
    로잘린드 "논리적인 흐름과 양식을 찾아 조합하는 과정이 효율적입니다."
    로잘린드 "저… 저……."
    주인공 "응? 하고 싶은 말이라도 있어?"
    로잘린드 "저녁을 준비해 드리겠습니다."

    독백 "하려는 말은 이게 아니었던 것 같은데……."

    # 주인공 "진짜로? 프로그래밍은 꽤 복잡할 수도 있는데."

    scene rosalind_programming with fadeoutin
    독백 "오늘은 저녁을 먹은 후에도 로잘린드가 움직일 생각을 않는다."
    독백 "의자에 가만히 앉아서 나를 바라보고 있었다."
    주인공 "로잘린드?"
    로잘린드 "하문하십시오."
    주인공 "하고 싶은 말이 있어? 아까도 뭔가 애매하게 넘어간 듯 한데……."
    로잘린드 "그것이……."
    로잘린드 "제 욕망을 감히 말씀드려도 될지요?"
    주인공 "그게 감히라는 말을 붙일 정도야?"
    주인공 "바라는 게 있으면 말해 봐. 내가 할 수 없는 일이라면 들어보고 거절해도 되니까."
    로잘린드 @미소1 "감사합니다."
    독백 "로잘린드의 얼굴에 미소가 스쳐지나갔다."
    로잘린드 "제 판단 능력과 암기력 덕분에 방대한 자료를 바탕으로 결과를 계산하는데에는 익숙합니다."
    로잘린드 "그러나 창의적 문제 해결이라는 개념은 아직 익숙하지 않습니다."
    로잘린드 "제게 프로그래밍과 문제 해결 능력을 가르쳐 주시겠습니까?"
    # 주인공 "너처럼 계산이 빠르고 암기력이 뛰어난 애가 프로그래밍까지 하면… 내가 가르칠 게 없겠는데?"
    # 로잘린드 "아니요. 주인님은 단순한 계산이 아닌, 창의적인 방법으로 문제를 해결합니다. 저는 그것을 배우고 싶습니다."
    주인공 "수나도 같은 과목을 배우고 있잖아. 그걸로는 부족해?"
    로잘린드 "저는 주인님께 더 깊은 내용을 배우고 싶습니다."
    주인공 "좋아. 일하는 날에는 저녁 먹기 전까지 하나하나 가르쳐 줄게."
    로잘린드 "기대하겠습니다."
    주인공 "우선 간단한 코드부터 시작하자. 예를 들어, 'Hello, world!'를 출력하는 것부터……."
    로잘린드 "작성을 완료했습니다." # (허공에 'Hello, world!' 출력 소스가 떠오름)
    독백 "말 꺼내자마자 코드가 화면에 떠오른다."
    주인공 "이거 좀 반칙 아냐? 난 직접 입력해야 하는데, 넌 그냥 생각만으로 코드를 넣고 있잖아."
    로잘린드 "효율성이 우선입니다."
    독백 "무표정으로 그리 말하니 꼭 로봇 같은 느낌이다."
    주인공 "그럼 계속 가르쳐 줄게."
    독백 "수나만큼은 아니지만 로잘린드도 굉장한 머리다. 한 시간만에 포인터까지 자유자재로 다룬다."
    주인공 "조금만 배우면 프로그래밍 능력은 나를 뛰어넘겠어."
    주인공 "목표만 설정하면 쭉쭉 늘겠는데."
    로잘린드 "목표라고 하셨습니까?"
    주인공 "응. 혹시, '이런 걸 만들어 보고 싶다'라고 생각해 본 적이 있어?"
    로잘린드 "생각해 본 적이 없습니다."
    주인공 "우선 거기서부터 시작하자. 지금 바로 만들어 보고 싶은 기능을 말해 봐."
    로잘린드 "……."
    독백 "로잘린드가 곰곰히 생각에 잠겼다."
    독백 "이럴 땐 방해하면 안 되지. 잠자코 기다렸다."
    독백 "한참을 생각하던 로잘린드가 마침내 입을 열었다."
    로잘린드 "아……."
    로잘린드 "지금 바로 생각나는 사항은 없습니다. 천천히 말씀드려도 되겠습니까?"
    주인공 "바로 떠올리기 어려워서 그래?"
    독백 "순간 로잘린드가 무언가 두려워하는 듯한 표정을 지었다."
    로잘린드 "그렇진 않습니다만……."
    주인공 "음, 뭐, 그래. 천천히 생각해 봐."
    로잘린드 "시간이 늦었습니다. 내일 아침에 뵙겠습니다."

    scene fiefMyRoom with dissolve
    독백 "로잘린드는 방으로 향했다."
    독백 "뭐지? 로잘린드의 그 두려워하는 표정이 머릿속에서 떠나지 않는다."

    return
