label rosalindEp03_1Apologize(forcePlay = False):

    if builditTesting and (not forcePlay):
        return

    독백 "지난번 일 이후로 로잘린드가 나를 계속 피한다."
    독백 "아침저녁으로도 식사만 가져다 주고 쌩하니 가 버린다."
    독백 "단단히 기분이 상했나보다. 오늘은 꼭 사과를 해야겠다."

    scene fiefOffice with dissolve
    독백 "집무실로 향했다. 다행히 시녀들이 전부 모여 있었다."
    독백 "이런 상황이면 대놓고 피하기는 어렵겠지."
    독백 "시녀들 가운데로 들어가 로잘린드의 손목을 잡았다."

    주인공 "로잘린드! 잠깐 시간 좀 내 줘."
    로잘린드 장옷 정면 놀람 "주인님? 갑자기 무슨……."
    독백 "더 이상 이야기를 듣지 않고 로잘린드를 잡아끌었다."

    scene black
    show 로잘린드 좌측면 장옷 놀람2:
        pos (.5, 0) anchor (.5, .0)
        zoom .6
    with dissolve

    독백 "아무도 없는 곳으로 로잘린드를 데려왔다."
    로잘린드 정색 "놓으십시오! 아픕니다."
    주인공 "미안……. 하지만 이렇게라도 하지 않으면 내 말을 전혀 안 들어 줘서……."
    로잘린드 정면 장옷 정색 "알겠습니다. 한 번 들어는 드리겠습니다."
    독백 "로잘린드에게 두 손을 모으고 사과했다."
    주인공 "우선, 너를 모욕하고 싶은 생각은 전혀 없었어."
    주인공 "네가 얼마나 큰 용기를 냈는지 헤아리지 못했어."
    주인공 "그만큼 네 마음을 거절했을 때 마음도 많이 상했겠지."
    로잘린드 보통 "……."
    독백 "다행히 로잘린드의 표정이 조금 누그러졌다."
    주인공 "하지만, 나는 언젠가 떠날 사람이야. 너와 결혼할 수는 없어."
    주인공 "무책임하게 누군가에게 큰 짐을 떠넘기지는 못하겠더라."
    주인공 "그러니까, 부디 마음 풀어 줘."
    로잘린드 @입벌림 "그게 무슨 말씀이십니까? 결혼이라니요?"
    로잘린드 "주인님께서 왜 저를 책임지십니까?"
    주인공 "아니……. 어쨌든……. 저기……. 임신을 할 수도 있잖아."
    주인공 "너한테 그렇게 부담만 주고 혼자 떠나버릴 수는 없어."
    로잘린드 미소1 "후……."
    로잘린드 @미소2 "그렇게 오해하셨군요."
    독백 "웃네. 다행이다."
    로잘린드 @미소2 "주인님께선 별천지인이 아니셨지요."
    로잘린드 "이 곳의 생활을 잘 모르셔서 하신 행동이었군요."
    로잘린드 "별천지에서는 누구나 아이를 낳을 수 있고, 영지에서 다 같이 합심해 기릅니다."
    로잘린드 @미소2 "그러니 주인님께서 저를 책임지실 이유는 없습니다."
    로잘린드 "그래도, 주인님의 마음은 잘 알았습니다. 기쁩니다."
    주인공 "그럼……."
    로잘린드 "그런 말씀까지 듣고 계속 화를 낼 수는 없지요. 용서해 드리겠습니다."
    주인공 "고마워, 로잘린드."
    로잘린드 "한 가지 여쯥고 싶습니다만……."
    주인공 "응. 물어 봐."
    로잘린드 "결혼이 뭡니까?"
    주인공 "어……."
    독백 "이걸 설명해야 하나?"
    주인공 "남자와 여자가 평생 함께 하겠다는 약속이야."
    주인공 "서로만을 바라보고 서로에게 정조를 지키고, 어 그러니까……."
    독백 "너무 당연하게 생각햇던 개념을 설명하려니 말이 계속 꼬인다."
    로잘린드 @웃음1 "그 정도면 충분합니다."
    로잘린드 @미소2 "다들 들으셨습니까? 주인님은 이렇게나 저를 생각해 주셨습니다."
    독백 "뭐?"
    독백 "뒤에서 시녀 일동이 나타났다."

    말리 정면 몬무스 "후작, 자기. 훌륭해."
    효주 "역시 가벼운 남자가 아니었구나."
    꼭지 "화난 척하고 이런 고백을 이끌어 낸 거야? 제법인데, 로잘린드?"
    루시 "오빠! 로잘린드는 똑똑하니까 조심해야 돼."
    카라 "사람을 휘어잡는 방법도 여러가지구나."

    로잘린드 웃음3 "주인님은 제게 당하셨습니다. 후훗……."
    show 로잘린드 웃음1

    독백 "이런이런. 제대로 한 방 먹었군."
    독백 "로잘린드가 이렇게 사람을 들었다 놨다 하리라곤 생각도 못 했다."

    return
