label rosalindEp04Fear(forcePlay = False):

    if builditTesting and (not forcePlay):
        return

    scene fiefMyRoom
    show 로잘린드 정면 몬무스:
        pos (.5, .0) anchor (.5, .0)
        zoom .5
    with dissolve

    독백 "오늘도 로잘린드에게 프로그래밍을 가르쳐 주었다."
    로잘린드 "주인님. 저……."
    주인공 "응, 말해."
    로잘린드 "만들어 보고 싶은 기능이 있습니다. 그런데……."
    주인공 "그럼 만들면 되지. 어려운 부분이 있어? 도와 줄까?"
    로잘린드 @입벌림 "아닙니다만……. 제가 만들어도 될지……."
    주인공 "안 되는 이유라도 있어?"
    로잘린드 "허락해 주시는 겁니까?"
    주인공 "배우는 입장에서는 당연히 시도할 수 있는 일이지. 얼마든지 해 봐."
    로잘린드 @미소2 "아……. 그렇군요."
    독백 "로잘린드는 화면에 하트 모양을 그렸다."
    로잘린드 @웃음1 "주인님을 향한 제 마음을 표현해 봤습니다."
    주인공 "한 가지 궁금한 게 있어."
    로잘린드 @입벌림 "하문하십시오."
    주인공 "네가 뭔가를 만들고 싶어할 때 지나치게 조심스러워 보여."
    주인공 "그 이유를 물어도 될까?"

    로잘린드 @입벌림 "그것이 궁금하셨습니까?"
    로잘린드 미소1 "제 약점을 드러내는 말이 되겠습니다만……."
    로잘린드 "주인님께선 제 약점을 이용하지 않으리라 믿으니 말씀드리겠습니다."
    독백 "나도 그리 고결한 인간은 아닌데 말이지."
    로잘린드 보통 "주인님께선 이곳, 별천지의 삶이 어떠셨습니까?"
    주인공 "두 손만 열심히 놀리면 먹고 살 수 있달까?"
    주인공 "부족한 건 없어 보였어. 뭐, 지구인인 내 입장에서야 먹을 거리나 재미가 적기는 했지만……."
    로잘린드 @웃음1 "정확하게 보셨습니다."
    로잘린드 "말리 님만 잘 돌보아 드려도 영지 전체가 충분히 먹고 삽니다."
    로잘린드 "단지, 이런 환경에서는 제 능력이 별 쓸모가 없습니다."
    주인공 "그 뛰어난 기억력과 연산 능력이?"
    로잘린드 "수백 자리 연산을 눈 깜빡할 사이에 해치울 수 있었지만……."
    로잘린드 @입벌림 "항상 쓸데없는 짓을 한다는 말을 들었습니다."
    주인공 "후……."
    주인공 "네 말이 공감된다."
    로잘린드 "주인님께서도요?"
    주인공 "나도 어린 시절에 항상 쓸데없는 짓 한다는 이야기를 들었어."
    주인공 "학교 공부 외에는 뭘 하든 구박을 받았어."
    주인공 "과학상자나 전자회로 만들기 같은 게 재미있었는데……."
    주인공 "세뱃돈 받아서 그런 걸 사오면 공부 안 하고 쓸데없는 짓 한다는 소리를 들었지."
    로잘린드 "말씀을 잘 알아듣지 못하겠습니다."
    주인공 "아, 지구에만 있는 물건들이라 잘 모르겠구나."
    독백 "간단히 설명을 해 주었다."
    로잘린드 "주인님께선 마치 수나 공주님 같습니다."
    주인공 "내가?"
    로잘린드 "호기심이 강하고 항상 새로운 물건을 만들려 시도하시는 면이 닮았습니다."
    로잘린드 "주변에서 쓸데없다는 말을 듣는 것도 비슷합니다."
    로잘린드 "저 역시도 그랬습니다."
    # 독백 "로잘린드는 내 말을 경청하더니 입을 열었다."
    # 과거의 
    로잘린드 보통 "그렇다 보니 제가 원하는 바를 말하는 데 항상 주저하게 되었습니다."
    로잘린드 "또 면박을 받지는 않을지, 비웃음을 사지는 않을지……."
    로잘린드 @입벌림 "그런 거리낌이 아직 마음 속에 남아 있습니다."
    주인공 "무슨 의미인지 알겠어."
    주인공 "로잘린드?"
    로잘린드 "예?"
    독백 "가르치는 입장 뿐 아니라, 한 사람으로서도 위로해 주고 싶다."
    주인공 "한 번 안아 줄까?"
    로잘린드 웃음3 "이럴 때 사심을 채우십니까?"
    주인공 "어 뭐……."
    로잘린드 미소2 "농담입니다. 주인님의 마음은 충분히 알았습니다."
    show 로잘린드 미소1
    독백 "로잘린드가 먼저 나를 끌어안았다."
    로잘린드 "누군가 저를 이해해 준다는 의미를……."
    로잘린드 "그 기분이 정말 든든하는 사실을 새삼 느낍니다."
    로잘린드 "그래서 저는 주인님을 좋아합니다."
    로잘린드 "단순히 여자와 남자가 아닌, 저를 이해해 주는 분이기에……."
    주인공 "로잘린드."
    로잘린드 "예?"
    주인공 "그냥 불러 보고 싶었어."

    # 키스신
    # H신을 본 이후에는 사랑을 나누는 선택지 추가

    return
