label rosalindWetDream():

    $ gHScene = True

    scene black
    pause 1.

    scene rosalind_bath:
        align (.5, .25)
    with dissolve

    독백 "나는 지금 로잘린드와 함께 강물에서 목욕을 하고 있다."
    독백 "로잘린드는 수영을 싫어했는데……. 언제 함께 강으로 왔지?"

    로잘린드 "물을 끼얹어 주십시오."
    독백 "바가지로 물을 떠서 로잘린드의 머리 위에 부어 주었다."
    로잘린드 "주인님과 함께 목욕하니 즐겁습니다."
    로잘린드 "왜 그러십니까? 제게서 눈을 떼지 못하시는군요."
    독백 "로잘린드의 나신은 눈부셨다. 다른 곳을 보는 시간 일분 일초가 아깝다."
    로잘린드 "몸을 닦아 드리겠습니다."
    독백 "로잘린드의 새하얀 손이 내 가슴에 닿았다."

    call ejaculate
    scene black with Dissolve(2.)
    pause 1.

    $ gHScene = False

    독백 "마치 영화관 전원이 나가듯 눈 앞에 보이는 모든 것이 검게 꺼져 버렸다."
    독백 "꿈이었나?"
    독백 "아랫도리가 축축하다. 으, 찝찝해. 설마……."
    독백 "이런 데서 몽정을 다 하다니."

    scene fiefMyRoom with dissolve

    독백 "재빨리 일어나서 주변을 살폈다."
    독백 "속옷이며 이불이 온통 젖었다. 이런……."
    독백 "이거 몰래 말릴 수 있으려나? 우선 방바닥에 이불을 펼쳐 놓았다."
    독백 "속옷이 달라붙어 버렸네. 살살 떼어내려 하는 참이었다."

    # 아침을 들고 들어오는 로잘린드.
    로잘린드 "주인님. 아침상을 올리겠습니다."
    독백 "으악?"
    주인공 "로잘린드? 잠깐. 조금만 기다려 줘."
    로잘린드 "왜 그러십니까?"
    독백 "재빨리 이불을 반으로 접어 침대 위에 올리고 급하게 겉옷을 걸쳤다."
    주인공 "들어와."
    독백 "평소처럼 사과 두 알과 차를 들고 들어온 로잘린드."
    독백 "창피하기도 하거니와 아침에 꾼 꿈이 자꾸 생각나서 로잘린드를 똑바로 바라볼 수 없었다."
    로잘린드 "주인님? 평상시와는 조금 다릅니다. 걱정이라도 있으십니까?"
    주인공 "아, 아무것도 아니야. 미안하지만 오늘 아침은 혼자 먹고 싶으니 나가 줄래?"
    로잘린드 "무언가 이상한 냄새가 납니다만……. 잠깐 살펴보겠습니다."
    주인공 "괜찮다니까? 아……."
    독백 "로잘린드는 내가 말릴 틈도 없이 이불을 펼쳤다."
    로잘린드 "맙소사. 온통 젖었군요."
    독백 "…… 망했다."
    로잘린드 "주인님은 다 큰 어른이 아닙니까? 아직도 소변을 못 가리시다니요."
    로잘린드 "새 침구를 준비해 드리겠습니다."
    독백 "아공간에서 새 이불을 꺼내 침대에 깐 로잘린드는 바닥에 놓인 젖은 이불을 살폈다."
    로잘린드 "빨래를 지시해야겠군요. 어……?"
    주인공 "로잘린드?"
    로잘린드 "이것은 소변 냄새가 아닙니다만……. 혹시……?"
    주인공 "그만! 내가 정리할 테니까 나가 줘."
    독백 "로잘린드의 어깨를 잡아 내보내려 했다."
    로잘린드 "주인님? 하지만 하얗고 찐득거리는 저 액체는……."
    주인공 "괜찮다니까?"
    로잘린드 "가만히 계십시오!"

    독백 "내 몸이 덜컥 멈추더니 침대 위에 눕혀졌다. 결박인가?"
    독백 "폐하처럼 압도적인 힘은 아니지만 팔다리에 바벨을 매달아 놓은 것처럼 움직일 수가 없었다."
    로잘린드 "설마, 내장이 녹아서 빠져나온 것입니까? 정밀 검사를 해야겠습니다."
    독백 "로잘린드가 저렇게 당황한 모습은 처음 본다."
    독백 "로잘린드의 옆에 CT 화면이 또 떠올랐다."
    로잘린드 "주인님의 신체에는 이상이 없습니다만……. 어딘가 편찮으신 곳이 있다면 말씀해 주십시오."
    주인공 "난 정말 멀쩡하다니까?"
    로잘린드 "정말입니까? 옷이 방해가 돼서 제가 잘못 보았을 수도 있습니다."
    로잘린드 "무례를 용서하시길……."
    주인공 "악! 따가워!"
    독백 "로잘린드가 손을 놀리자 내 옷이 모두 벗겨졌다. 달라붙어 있던 속옷이 그대로 뜯겨나갔다."
    독백 "따가움과 창피함에 눈물이 절로 나왔다."
    주인공 "으흑……."
    로잘린드 "고통에 눈물까지 흘리시는군요. 정확하게 다시 검사해 보겠습니다."
    로잘린드 "저희는 주인님을 몸 성히 돌려보내 드려야 합니다. 그렇지 못한다면……."
    독백 "내가 결박돼 있는 사이 로잘린드는 몇 번이나 내 몸을 살폈다."
    로잘린드 "저로서는 도저히 모르겠습니다. 공주님과 다른 분들을 모셔오겠습니다."
    주인공 "안 된다니까! 그만!"
    로잘린드 "주인님?"
    독백 "내가 악을 쓰자 로잘린드는 놀란 얼굴로 나를 바라보았다."
    독백 "그대로 두었다간 전원에게 내 알몸을 공개하게 생겼다. 창피함을 무릅쓰고 고백했다."
    주인공 "몽정을…… 했어……."
    로잘린드 "몽정이라고요? 그게 뭡니까?"
    독백 "몽정을 몰라?"
    주인공 "그러니까…… 잠자는 사이에 정액을 배출했다고."
    로잘린드 "뭐라고요? 그럼 더 큰일이 아닙니까? 즉시 공주님을 모셔오겠습니다."
    주인공 "또 왜?"
    로잘린드 "왜라니요? 이대로라면 주인님께서 돌아가십니다."
    주인공 "뭐?"
    로잘린드 "남자는 일생에 한 번, 종족 번식의 의무를 다 하면 그 다음날 세상을 떠납니다."
    로잘린드 "모르고 계셨습니까?"
    주인공 "그게 무슨 소리야? 사람이 한 번 사정했다고 죽는다니?"
    주인공 "나는 그렇지 않아."
    로잘린드 "그러……십니까? 정말입니까?"
    독백 "로잘린드는 조금 진정한 것처럼 보였다."
    주인공 "응. 몇 번이고 괜찮아."
    독백 "로잘린드는 침대에 누운 내 몸을 몇 번이고 살폈다."
    로잘린드 "정말이군요. 주인님의 신체에는 아무 이상이 없습니다."
    로잘린드 "제가 당황해서 무례를 저질렀습니다. 부디 용서를……."
    독백 "내게 고개를 숙여 사죄하는 로잘린드. 그런데……."
    # 가슴골 클로즈업
    독백 "하필 눈에 들어온 장면이……. 내 분신이 또다시 슬그머니 고개를 든다."
    독백 "분위기 파악 못 하는 저 분신 놈 덕분에 창피해 죽을 것만 같다."
    로잘린드 "아……."
    독백 "그걸 바라보던 로잘린드의 표정이 점점 몽롱해진다."
    독백 "로잘린드는 아공간에서 수건을 꺼내 내 몸을 정성껏 닦았다."
    독백 "그 자극에 점점 솟아오른다."
    독백 "수건을 다시 아공간에 넣은 로잘린드가 내 몸 위로 살며시 올라왔다."
    주인공 "로잘린드?"
    로잘린드 "저는 주인님께 과학을 배웠습니다."
    로잘린드 "제자로서, 주인님의 말씀을 직접 검증해 보고 싶습니다. 제 탐구심을 충족시켜 주시겠습니까?"

    menu:
        "로잘린드와 사랑을 나눈다.":
            jump rosalindFirstSex
        "로잘린드의 마음을 거절한다.":
            pass

    독백 "안 돼. 정신차리자."
    주인공 "미안. 로잘린드. 나를 좋게 봐 준 건 고마워."
    주인공 "하지만, 나는 언젠가 떠날 입장이야."
    주인공 "너 자신을 소중하게 여기도록 해. 더 좋은 사람이 있을 거야."
    로잘린드 "진심이십니까?"
    주인공 "응."
    로잘린드 "정말, 진심으로 거절하시는 겁니까?"
    주인공 "……응."
    로잘린드 "……."
    로잘린드 "잘 알겠습니다. 그래도 혹시 모르니 건강에 유의하시길 바랍니다."
    독백 "로잘린드는 토라진 듯 몸을 일으켜 그대로 나가 버렸다."
    주인공 "로잘린드? 결박은 풀어 주고 가야지."
    # (효과음)

    독백 "문 밖에서 마법을 풀었는지 몸이 자유로워졌다. 로잘린드의 모습이 계속 머릿속에 남아 가라앉지 않는다."
    독백 "한참을 누워 있자 간신히 걸어다닐만큼 수그러들었다."
    독백 "우선 이불부터 내다 널자."

    return

label rosalindFirstSex():

    $ gHScene = True

    독백 "그래. 로잘린드의 입장에서는 엄청난 용기를 냈겠지."
    독백 "이걸 거절하는 것도 예의가 아니다."
    독백 "……."
    독백 "아니. 다 핑계다. 그냥 로잘린드가 너무나 예뻐 보인다."
    독백 "한 남자로, 로잘린드를 안고 싶다."
    독백 "로잘린드는 별천지에 온 이후로 내내 내게 헌신적이었다. 그런 로잘린드에게 내 처음을 주고 싶다."

    주인공 "지금까지 했던 말은 전부 취소해 줘."
    로잘린드 "주인님? 설마 거절하시는 겁니까?"
    주인공 "아니야. 내가 먼저 말할게."
    주인공 "로잘린드, 너를 가지고 싶어."
    로잘린드 "기꺼이……."
    로잘린드 "결박을 풀어 드리겠습니다."

    # 애무신 menu 구현

    scene rosalind_bedscene:
        align (.5, .0)
    with dissolve

    독백 "로잘린드를 침대에 눕혔다."
    독백 "이렇게 하는 게 맞겠지?"
    독백 "서서히 로잘린드의 안으로 들어갔다."
    로잘린드 "큭! 으……."
    주인공 "아파? 그만 할까?"
    로잘린드 "아닙니다. 중간에 끊고 싶지 않습니다."
    독백 "이렇게 아파할 줄이야……. 그런데…… 여자의 안쪽이 이리도 부드럽고 자극적이구나."
    로잘린드 "으윽……."
    독백 "안 돼……. 이제 막 들어갔는데……."

    call ejaculate

    로잘린드 "주인님?"

    $ gHScene = False

    # 이불로 몸을 가린 로잘린드, 뒤로 앉아 있는 주인공
    로잘린드 "……."
    주인공 "……."
    로잘린드 "주인님. 이게 대체 뭡니까?"    
    로잘린드 "주인님을 믿었기에 저를 가지게 해 드렸는데……."
    주인공 "미안……."
    로잘린드 "평생에 한 번뿐인 행사가 이리도 허망하게 끝나다니요."
    주인공 "나도 처음이라……. 이렇게 자극이 강할 줄은 몰랐어."
    주인공 "염치 없지만, 또 기회를 준다면 그 때는 더 노력해 볼게."
    로잘린드 "무엇이라? 운우지정을 또 나눌 수 있다는 말씀이십니까?"
    로잘린드 "험험. 이것도 탐구심일 뿐입니다."
    독백 "얘 성격이 좀 바뀌지 않았나?"
    로잘린드 "제 탐구심을 마저 채우고 싶습니다."

    독백 "이불로 가슴을 가리고 있는 로잘린드는 아주 매력적이었다."
    독백 "아랫도리에 다시 힘이 들어간다."
    독백 "온 몸에 힘이 다 빠질 때까지 로잘린드와 연거푸 사랑을 나누었다."

    # 이불로 허리 아래(가슴 아래)를 덮은 채 옆으로 누운 로잘린드
    로잘린드 "좋았습니다, 주인님."
    독백 "로잘린드는 내 가슴을 손가락으로 훑었다."
    로잘린드 "육체가 이리 강건한 데에는 다 이유가 있었군요."
    주인공 "너도 너무나 매력적이야, 로잘린드."
    로잘린드 "후훗……."
    주인공 "네가 이렇게 웃는 모습은 처음 봐."
    로잘린드 "지금은 감정을 온전히 표출하고 있으니까요. 이유는 천천히 말씀드릴 기회가 있겠지요."
    로잘린드 "몸을 씻으러 가시겠습니까?"
    주인공 "그러자."
    독백 "로잘린드는 젖은 이불과 내 옷을 모두 아공간에 넣고 자리에서 일어났다."

    # 강으로 차원문 엶
    # 강에서 목욕과 빨래를 한 후 나무 위에 앉아서 마르기를 기다림
    scene rosalind_bath:
        align (.5, .25)
    with dissolve

    독백 "로잘린드의 머리에 바가지로 물을 부어 주었다."
    주인공 "로잘린드, 있잖아."
    로잘린드 "말씀하십시오."
    주인공 "사실 지금 이 장면을 아침 꿈에서 봤어."
    로잘린드 "제가 예뻐서 주인님 머릿속에 계속 떠오르는 건 아닙니까?"
    주인공 "지금 여기선 그렇다고 해야겠지?"
    로잘린드 "깔깔깔……."

    # 겉옷을 짠 후 다 마른 빨래를 걷어서 돌아오는 장면
    독백 "목욕을 끝낸 후 로잘린드는 바위 위에 올라앉아 웬 방망이 하나를 꺼내들었다."
    독백 "이불과 옷가지를 방망이로 두들겨 가며 빠는 로잘린드."
    주인공 "침방에 지시하지 않고 네가 직접 하네?"
    로잘린드 "주인님과 함께 한 결과이지 않습니까? 제가 빨아 드리고 싶습니다."
    # 독백 "빨래를 마치고 허공에 마법으로 빨래감을 고정시킨 로잘린드."
    독백 "빨래를 마친 로잘린드는 아공간에서 옷을 한 벌 꺼내어 건네 주더니 바위 위에 앉아 반짇고리를 꺼냈다."
    주인공 "옷을 만들려고?"
    로잘린드 "그렇습니다. 보고만 계십시오."
    독백 "로잘린드의 옆에 앉아서 옷이 완성돼가는 모습을 지켜보았다."
    독백 "이번 옷은 꽤 넓게 짜는 듯하다."
    독백 "따뜻한 햇볓에 온 몸이 적당히 데워진다. 기분 좋은 노곤함이 온몸을 감싼다."
    독백 "로잘린드의 모습을 보고 있는 것만으로도 마음이 충만해지는 느낌이다."
    독백 "해가 서쪽으로 기울기 시작할 때쯤 옷이 완성되었다."

    # 빨래방망이 넣을까?
    # 결혼 제도가 없음
    # 남자들은 궁궐 깊은 곳에서 절대적으로 보호받으며 자람

    로잘린드 "저와 짝을 이루도록 두루마기를 짰습니다."
    로잘린드 "입혀 드리겠습니다."
    독백 "로잘린드는 내 어깨에 옷을 걸치고 옷고름을 매 주었다."
    주인공 "계속 받기만 하니까 뭔가 미안하네."
    로잘린드 "그러십니까?"
    주인공 "나는 정말 몸뚱아리밖에 가진 게 없으니까."
    주인공 "그럼……. 보답이라긴 뭐하지만, 방까지 업어다 줄까?"
    로잘린드 "주인님의 등에 말입니까? 저는 좋습니다."

    독백 "로잘린드를 업고 들어오며 담소를 나누었다."
    로잘린드 "그렇군요. 지구에는 결혼이라는 제도가 있군요."
    주인공 "응. 남자와 여자가 함께 하겠다는 약속이야."
    주인공 "짝을 이룬 남녀가 사랑을 나누고, 아기를 낳지."
    로잘린드 "새로 낳은 아기는 영지에서 함께 기릅니까?"
    주인공 "아니. 부부가 그 부모에게 도움을 청하거나 타인을 고용하기도 하지만 보통은 온전히 부부의 몫이야."
    로잘린드 "그 많은 수를 둘이서 온전히 감당합니까? 저라면 알 2,000명은 낳을 수 있습니다."
    주인공 "와. 아이들만으로도 마을 하나는 이루겠네."
    주인공 "지구의 여자들은 보통 아기 한 명을 낳는데."
    로잘린드 "알이 아닌 아기를 한 명씩만 낳는다는 말씀이십니까?"
    주인공 "응."
    로잘린드 "그런데 어떻게 인구 유지가……. 아! 남자가 계속 함께 있으니 아기를 또 낳을 수 있겠군요."
    주인공 "맞았어."
    로잘린드 "주인님과 이야기하다 보면 항상 새로운 지식을 얻습니다."
    로잘린드 "여기, 별천지에서는 알을 낳고 영지에서 모두 합심해 기릅니다."
    로잘린드 "짝짓기 행사 때에 남자가 누구를 선택할지 모르니까요."
    로잘린드 "수나 공주님이라면 알을 10만 명까지는 낳으실 수 있을 겁니다."
    주인공 "그렇게나 많이?"
    로잘린드 "많은 수치는 아닙니다. 다른 공주님들은 아무리 적어도 100만명 수준입니다."
    로잘린드 "지금의 폐하께서는 무려 250만명을 낳으셨습니다. 7년이 걸렸다고 들었습니다."
    주인공 "그게 감당이 돼?"
    로잘린드 "그렇기에 보통 공주들은 우화 이전에 영지를 수여받고 번창시키려 노력합니다."
    로잘린드 "나중에 알을 기를 수 있는 여건을 미리 준비해 두는 의미입니다."
    로잘린드 "영민들이 많을수록 알을 돌보아 줄 사람도 많아지니까요."
    로잘린드 "남자들도 자신의 알을 많이 퍼뜨리고 싶어하기에, 보통 공주와 짝을 이룬다고 알고 있습니다."

    독백 "이야기를 나누다 보니 어느 새 마당까지 들어왔다."
    효주 "요. 둘이 언제 그렇게 친해졌어?"
    독백 "로잘린드가 내 등에서 날개를 파닥거린다."
    로잘린드 "제가 주인님께 아주 소중한 것을 드렸습니다. 그 보답이지요."
    효주 "뭔지 궁금한데?"
    로잘린드 "안 알려 드립니다. 후훗……."
    효주 "로잘린드 너도 그렇게 웃는구나. 알았어. 내키면 말해 주겠지 뭐."
    효주 "후작. 또 운동하러 와."
    독백 "효주는 손을 팔랑거리며 어디론가 향했다."
    주인공 "우리도 방으로 갈까?"
    로잘린드 "지금은 주인님의 침구부터 정리해야지요."

    scene fiefMyRoom with dissolve
    독백 "방 정리가 끝난 후 로잘린드는 나를 끌어안았다."
    로잘린드 "지금은 주인님과 떨어지고 싶지 않습니다만……."
    로잘린드 "또 뵐 수 있으니까요. 그럼……."
    독백 "로잘린드는 평소의 무표정으로 돌아왔다."
    로잘린드 "내일 아침에 뵙겠습니다."
    독백 "고개를 꾸벅 숙이고 방을 나가는 로잘린드."
    독백 "달콤한 기분에 빠져 실실 웃으며 침대에 누웠다."
    독백 "지구에 살 때는 인연이 없었는데 이세계에 와서 이런 일이 생기다니……."
    독백 "별천지에 눌러앉을까?"
    독백 "이런저런 생각을 하다가 그대로 잠들었다."
    scene black with dissolve

    return
