label lucyEp01LampPost(forcePlay = False):

    if builditTesting and (not forcePlay):
        return

    # 영지 순찰
    # 우물 위에 빛 공을 매다는 루시
    # 어두워질 때까지 빛을 매달도 옷을 훌렁 벗어 비키니 차림이 되는 루시
    # 강으로 수영하러 감

    scene fiefOffice with dissolve

    수나 "영지를 둘러보라는 말."
    주인공 "알았다는 말."

    scene fiefYardDay

    독백 "영지를 둘러보고 돌아가려 할 때였다."
    독백 "해가 지려는 숲길에서 무언가 반짝이는 것이 보였다."
    독백 "분명 사람 형상인데?"
    루시 "오빠?"
    주인공 "루시였구나?"
    루시 "응. 이 저녁에 뭐 해? 해지면 깜깜해질텐데."
    주인공 "영지를 둘러보던 중이었지. 수나의 명령이기도 하고……."
    주인공 "그런데, 너야말로 어두워지는데 돌아다녀도 괜찮아?"
    루시 "나는 빛을 낼 수 있으니까."
    루시 "어두운 곳에서도 걱정 없어."

    # 루시의 수다
    독백 "루시와 함께 거닐며 이야기를 나누었다."
    
    루시 "오빠가 공주님이며 말리를 잘 돌봐 주니까 영지가 활발해진 느낌이야."
    루시 "우리끼리만 있을 때보다 시원시원한 느낌이랄까?"
    주인공 "나도 영지를 돌아보면 기분이 좋아. 왠지 내가 이 영지를 가꾼다는 느낌이 들어서 뿌듯하기도 해."
    루시 "헤헤……. 가끔 날아다니면서 영지 모습을 빛으로 찍어 둬."
    루시 "볼래?"
    독백 "허공에 영지의 조감도 같은 것이 떠올랐다."
    루시 "나는 빛을 다루니까, 뭐든지 있는 그대로 찍을 수 있어."
    루시 "로잘린드만큼 기억력이 좋지는 않아서 금방 잊어버리지만……."
    루시 "돌에 빛을 새겨 두면 언제든 그대로 꺼내 볼 수 있어."
    루시 "그래서 다른 영지에 소식을 전할 일이 있으면 보통 내가 가."
    루시 "이 노리개에 전달할 내용을 새겨 두었다가 그대로 틀어서 보여 드리지."
    루시 "우리 영주관을 만들 때도 내가 왕복하면서 공주님의 지시사항을 전달했어."
    독백 "꽤 수다스러운 친구다."
    루시 "아, 오빠. 잠깐."
    주인공 "왜?"
    루시 "우물이야."

    scene lucy_1stmeet with dissolve

    독백 "루시는 겉옷을 벗고 날아올랐다."
    주인공 "으힉?"
    독백 "안은 비키니 차림이네?"
    독백 "루시는 우물 옆의 버드나무 꼭대기에 빛나는 구체를 하나 매달았다."
    독백 "땅에 내려앉은 루시는 옷을 주워들어 아공간에 넣었다."
    주인공 "꽤 대담하네?"
    루시 "뭐가?"
    주인공 "아, 아무것도 아니야. 평상시에 항상 수영복을 입고 다녀?"
    루시 "응. 나는 수영을 좋아하거든."
    루시 "밤새 돌아다니면서 빛을 매달아 두다가, 다 끝내면 강변에서 수영을 하지."
    루시 "아, 또 우물이다."
    독백 "루시는 또 날아올라 버드나무 위에 빛을 매달았다."
    주인공 "그걸 왜 매달아 둬? 물어 봐도 돼?"
    루시 "당연히 되지. 밤에도 목이 마른 사람들이 있을 수 있잖아?"
    루시 "그 때 내 빛을 보고 우물을 찾을 수 있어."
    루시 "다른 영지에서 손님들이 올 때도 내 빛을 따라오기만 하면 영주관으로 올 수 있지."
    루시 "그러니까 누구든 내가 있는 곳에선 어둠을 두려워하지 않아."
    주인공 "멋있어."
    독백 "박수를 쳐 주었다."
    루시 "헤헤, 나 멋있어?"

    독백 "이야기를 나누며 걷다 보니 어느새 경작지의 끝에 다다랐다."
    독백 "해가 져서 사방이 어둡다."
    주인공 "이제 돌아가 볼까?"
    루시 "그러자. 내가 영주관까지 바래다 줄게."
    독백 "루시가 손을 놀리자 허공에 영주관의 모습이 홀로그램처럼 생겨났다."
    루시 "차원문이야. 여기로 들어가면 바로 영주관 마당이지."
    주인공 "어? 너도 차원문 마법을 쓸 수 있어?"
    루시 "시녀들의 기본 소양이야."
    루시 "차원문과 아공간 마법을 쓸 정도의 마력이 있어야 시녀 자격이 있어."
    독백 "루시는 으스대며 멋진 표정으로 그렇게 말했다."
    루시 "황궁과 영지를 연결하려면 공주님 정도는 돼야 하지만, 영지 안에서 이동 정도는 시녀들 누구나 가능해."
    주인공 "그럼 왜 다들 걸어다녀?"
    루시 "마법을 쓰려면 상당히 집중해야 하거든. 그래서 한두번 쓰면 지치게 되더라."
    루시 "공주님이나 로잘린드 정도라면 하루 종일도 쓸 수 있겠지만……."
    루시 "너무 마법만 쓰면 게을러진다고 일부러 몸을 움직이더라."
    주인공 "알 듯 말 듯 하네."
    루시 "에구, 더 늦으면 깜감해지겠다. 가자, 오빠!"
    독백 "차원문을 통과하자 바로 영주관 마당이었다."
    루시 "그럼 잘 자. 난 수영하러 갈게."
    독백 "루시는 그리 말하며 몸에서 빛을 뿜어냈다."
    주인공 "응. 오늘 고마웠어."
    독백 "루시는 바로 하늘로 날아올랐다."
    독백 "루시가 남긴 잔광이 하늘을 가로지른다. 참 아름다운 광경이다."

    scene black with dissolve

    return
