label ch03Eclosion:

    scene palaceStudyRoom with fadeoutin
    독백 "한 달이 후딱 지나갔다. 수나는 1학년 과정을 다 떼었다."
    독백 "정말 놀라운 속도다. 이런 천재가 정말 있구나."
    독백 "수나를 가르치는 일은 재미있었지만, 한편으로는 좀이 쑤신다."
    독백 "노트북은 로잘린드가 흡수해 버렸고, 휴대폰을 켜 봐야 전파가 안 잡히니 서핑도 못 한다."
    독백 "수나에게 공부를 가르쳐 주는 시간 외에는 가볍게 조깅을 하거나 방에서 맨몸운동을 했다."
    독백 "학교와 집, 운동만으로 살다 보니 시간이 텅 비었을 때 할 일이 없다. 다른 취미도 가져 볼 걸 그랬나?"
    독백 "닭가슴살 맛 사과와 차 외에는 먹을 것도 없다."
    독백 "마지막 장의 마지막 문제를 풀고 나자, 로잘린드가 입을 열었다."

    # 뭔가 좀 더 넣어야 될 것 같기도 한데...
    로잘린드 "공주님, 주인님!"
    로잘린드 "제 우화가 임박했습니다. 함께 가 주시겠습니까?"
    수나 "가자꾸나, 후작. 로잘린드가 성인이 되는 순간을 마음에 담는 게다."
    독백 "우리는 별실로 향했다."

    ## 로잘린드 우화 장면
    # 별실
    독백 "로잘린드의 작은 몸이 빛에 휩싸이더니 곧 우리 앞에 거대한 고치 하나가 생겨났다."
    수나 "조용히 기다리거라."
    독백 "수나의 말에 입을 다문 채 가만히 서 있었다."
    # "(고치에서 알몸으로 나오는 로잘린드)"
    독백 "한 시간쯤 지났나? 고치의 윗부분이 열리더니, 곧 늘씬한 여성 한 명이 웅크린 채 나타났다."
    주인공 "히익?"
    독백 "알몸이네."
    수나 "눈을 돌리지 말고 잘 봐 두어라. 성인으로 재탄생한 로잘린드이니라."
    독백 "안 그래도 눈 떼기가 힘들다."
    독백 "로잘린드가 천천히 몸을 일으킨다. 허공에서 옷이 생성되어 로잘린드의 몸을 감쌌다."
    로잘린드 "공주님, 주인님. 로잘린드, 다시 인사드립니다."
    수나 "나 역시도 반갑노라. 앞으로 잘 해보자꾸나, 로잘린드."
    주인공 "……."
    독백 "너무 갑자기 성장해버리니 도리어 낯설다."
    로잘린드 "주인님? 왜 그러십니까? 그 연세에 낯을 가리시나요?"
    주인공 "아니, 그냥 당황했을 뿐이야. 앞으로 잘 해보자, 로잘린드."
    로잘린드 "내일이 공주님께서 영지를 수여받는 날입니다. 그 절차를 준비하겠습니다."

    scene palace with dissolve
    독백 "다음 날."
    # 영지 수여 장면

    # 주인공 "아니, 저... 옷은 입으라고."

    ## 이후 영지를 수여받아 떠나는 수나
    ## 주인공을 따로 불러 수나를 잘 돌봐 달라는 원화

    return
