label ch04Yutnori(forcePlay = False):

    if builditTesting and (not forcePlay):
        return

    # 휴일 아침
    # 이 곳의 휴일은 그저 먹고 뒹굴거리는 것 외에는 할 일이 없다
    # 좋아. 한국의 전통놀이를 여기에 전파해 볼까?
    # 윷놀이 전파
    # 마법으로 윷가락을 고정시켜 모만 스물 두 번 던지는 수나
    # 야. 그냥 노는 건데 마법을 쓰면 어떡해? 이건 반칙이야.
    # 그래도 지긴 싫단 말이니라!
    # 에휴. 이건 뭐 방법이 없네.

    scene fiefMyRoom with dissolve

    독백 "로잘린드가 아침을 차려 주고 자기 방으로 돌아갔다."
    독백 "오늘은 휴일이지만 딱히 할 것도 없다."
    독백 "전기가 없으니 휴대폰도 켤 수 없고 다른 읽을거리나 게임도 없다."
    독백 "운동을 더 하자니 오버트레이닝이 될 것 같고……."
    독백 "뭔가 오락거리라도 만들어 볼까? 쉽게 만들 수 있는 거라면……."

    scene fiefOffice with dissolve

    독백 "로잘린드가 방에 없어서 혹시나 해서 영지 집무실에 와 보았다."
    독백 "시녀들이 모두 모여 있었다."
    주인공 "다들 여기 있었네?"
    로잘린드 정면 일상복1 "주인님? 휴일인데 웬 일이십니까?"
    주인공 "응. 심심해서……. 뭔가 좀 만들어 볼까 하고……."
    카라 "심심하면 방에서 잠이라도 자. 뭐하러 힘빠지게 돌아다니고 있어?"
    주인공 "낮에 자면 밤에 못 잔단 말이야."
    말리 정면 일상복1 "그럼 후작 자기도 나랑 일광욕 할래?"
    효주 "누워 있기만 하면 무슨 재미야? 나하고 같이 땀 빼자."
    효주 "후작이 만들어 준 바벨이란 들돌, 편해서 좋더라."
    루시 "아님 나하고 수영할래? 시원하게 강물에 몸 담그고 놀자."
    꼭지 "그러지 말고 나랑 벌레 잡으러 가자. 오빠가 잡은 건 내가 다 먹어 줄게."
    주인공 "다들 심심해? 그럼 왜 여기 모여 있어? 각자 놀면 되지."
    로잘린드 "혹시 영지에서 무슨 일이 생길지 모르니 다들 대기 중입니다."
    주인공 "아, 비상대기조라는 이야기인가? 그럼 나도 부르지 그랬어."
    루시 "무슨 일 있으면 우리가 데리러 갈 수 있으니까."
    루시 "특별히 여기 없어도 되긴 해. 혼자 놀기는 심심하니까 모여 있는 거지."
    독백 "다들 선호 분야가 제각각이니……. 뭐 슬슬 밑밥은 깔린 것 같다."
    주인공 "그럼 나하고 놀거리 하나 만들어 볼래?"
    효주 "놀거리? 만들자! 뭔데?"
    주인공 "윷놀이라는 건데 막대기를 던져서 나온 결과로 승부를 가르는 놀이야."
    수나 "오호, 나도 낄 수 있겠느냐?"
    독백 "공주도 왔네."
    주인공 "너도 심심했어?"
    수나 "후작이 내 준 숙제는 어젯밤에 다 풀었느니라."
    주인공 "벌써?"
    독백 "내가 사흘 동안 머리 싸매고 풀 만한 분량의 문제를 내 줬는데……."
    주인공 "좋아. 그럼 오늘 하루는 신나게 놀아 보자. 우선 도구를 만들어야 해."
    수나 "도구? 무엇을 만들어야 하는지 말해 다오."
    독백 "준비물을 말해 주자 수나가 시녀들에게 지시를 내렸다."
    수나 "말리. 나무 판자와 작대기를 준비해 다오."
    수나 "루시. 네가 강가에 가서 조약돌을 골라 두거라."
    수나 "모두 주우면 꼭지에게 연통을 넣거라. 바로 공간전이로 오면 될 것이니……."
    독백 "곧 막대기와 칼, 그리고 판자와 희고 검은 조약돌 다섯 개씩이 모였다."
    주인공 "우선 윷판을 그려야 해. 그 다음엔 칼로 나무를 다듬어서……."
    독백 "윷판과 윷가락까지 준비됐다."
    주인공 "이렇게 윷가락을 던져서 나온 결과로 말을 이동시키면 돼."
    수나 "네 개가 모두 뒷면이면 윷, 모두 앞면이면 모이고, 윷가락을 한 번 더 던질 수 있다는 말이로구나."
    주인공 "맞았어."
    로잘린드 "확률적으로는 개가 가장 많이 나올 것으로 예측됩니다."
    수나 "그럼 편을 갈라서 한 번 해 보자꾸나."

    독백 "나와 로잘린드, 루시, 꼭지가 한 편이 되고, 말리와 효주, 카라, 수나가 한 편이 됐다."
    독백 "윷가락을 던져 선공을 정하자 우리 편이 이겼다."
    수나 "흠. 우리 편이 졌구나. 먼저 던지거라."
    주인공 "그럼 한다."

    독백 "내가 윷을 던지자, 개가 나왔다."
    로잘린드 "평균적인 결과로군요."
    주인공 "좋아. 판에 말을 올리고……."
    독백 "각자 말을 던지고 수나의 차례가 왔다."
    수나 "그럼 던지겠노라."
    독백 "모가 나왔다."
    일동 "우와."
    독백 "처음으로 한사리 했네."
    수나 "보았느냐? 이것이 공주의 실력이니라. 모가 나왔으니 또 던지겠노라."
    독백 "또 모가 나왔다."
    주인공 "어?"
    로잘린드 "공주님께서 256분의 1 확률을 달성하셨군요."
    독백 "또 모가 나왔다."
    독백 "또 모가 나왔다…."
    독백 "또 모가 나왔다……."

    scene fiefOffice with fadeoutin

    독백 "수나는 모를 스물 두 개 던지고서야 멈췄다."
    주인공 "뭐야? 우연이라기엔 너무 잘 나오는데."
    말리 "이런이런……. 윷가락에서 마력이 새어나오는군요, 공주님."
    주인공 "다들 재미로 노는 건데 마법을 쓰면 어떻게 해?"
    수나 "마법도 실력이니라."
    루시 "공주님……."
    꼭지 "뭔가 이상하다 했습니다."
    카라 "이러면 공주님 편이 무조건 이길 수밖에 없어요."
    효주 "우리 편이 이기는 건 기분 좋지만 이건……."
    로잘린드 "확률에 기대는 놀이는 하기 힘들겠군요."

    수나 "물론이니라. 본 공주는 왕가의 일원이니 절대 패배할 수 없느니라."
    수나 "왕가의 일원이 패배하면 위엄이 무너지느니라."
    주인공 "뭐야. 그냥 지기 싫어서 억지 부리는 거잖아."
    말리 "자기, 너무 심각하게 받아들이지 마."
    말리 "공주님이 이기고 싶으시면 계속 진행하시죠."
    꼭지 "아……. 해충 냄새가 나요. 배도 채울 겸 해서 한 바퀴 둘러보고 오겠습니다."
    루시 "……. 슬슬 더워지는 것 같습니다. 자유시간이니 헤엄 치러 가겠습니다."
    효주 "저도 근육 단련할 시간입니다. 다녀와서 보고 드리겠습니다."
    카라 "쓰레기가 더 늘기 전에 깨끗이 청소부터 하겠습니다."
    독백 "네 명이 슬금슬금 자리를 떴다."
    로잘린드 "주인님? 방으로 가시죠. 저에게 프로그래밍을 더 알려 주십시오."
    수나 "뭐냐. 왜 다들……."
    주인공 "수나. 재미로 하는 놀이인데, 지기 싫다고 마법을 쓰면 어떻게 해?"
    주인공 "다들 김이 샜잖아. 다음에 보자."
    독백 "로잘린드와 함께 내 방으로 향했다."

    scene black with dissolve
    수나 "나는 그냥 지기 싫었을 뿐인데……."
    말리 "공주님. 저와 둘이서 노시죠."
    수나 "다 같이 놀고 싶었단 말이다……."
    말리 "그럼 지는 방법도 아셔야 한답니다."

    return
