label ch05Ramen(forcePlay = False):

    if builditTesting and (not forcePlay):
        return

    # 드디어 사과에 질려 버렸다.
    # 가방에서 라면을 꺼내 먹으려는 주인공
    # 로잘린드에게 물을 끓여 달라고 함
    # 둘이서만 나눠 먹기
    # 
    # 갑자기 들이닥치는 수나와 시녀 일동
    # 라면을 죄다 빼앗기고 국물 맛만 본 주인공
    # 국수호박과 향신료, 퉁퉁마디 열매를 소개해 주는 말리
    # 어설프게 라면을 재현한 주인공
    # 텃밭 해금됨

    # 이 장면 이후 로잘린드의 호감도와 관계없이 '몽정' 신 나옴
    독백 "보람찬 하루일을 끝마치고서 두 다리 쭈욱 펴면 영주관 내 방."
    독백 "혼잣말로 농담을 해 봐도 별로 기분이 나아지지 않는다."
    독백 "별천지에 와서 먹은 것이라곤 닭가슴살 맛 사과와 차 뿐."
    독백 "아끼고 아껴 왔지만 더는 못 참겠다."
    독백 "가방을 뒤져 보았다."

    주인공 "크! 이거지!"
    독백 "나와 함께 별천지로 건너온 돗대 컵라면!"
    독백 "여기에 끓는 물만 부으면 오늘의 별식 완성이다."
    주인공 "아아, 나의 마지막 라면이여. 오늘 나와 하나가 되자."
    독백 "그런데 끓는 물을 어디서 구하지?"

    return

