label ch09Portal(forcePlay = False):

    if builditTesting and (not forcePlay):
        return

    # 모터를 이용한 펌프를 만들자
    # 나무로 파이프와 기어를 깎고 모터와 연결해 물펌프를 만듦
    # 수나에게 강변으로 가서 펌프를 설치해 보겠다고 하자, 루시를 부르는 수나
    # 수나: 루시. 네가 수영을 좋아하니, 강변에 가서 작업을 도와 주거라
    # 루시: 알겠습니다, 공주님.
    # 차원문을 열고 강변으로 주인공과 함께 온 루시
    # 주인공: 너도 차원문을 쓸 수 있어?
    # 루시: 시녀들 정도의 마력이 있어야 사용 가능해
    # 물 속에서 펌프를 설치하려다 감전된 주인공
    # 루시가 전기를 마력으로 변환해 허공으로 방출해 버림
    # 주인공: 루시 네가 내 생명의 은인이다
    # 전력-마력 변환기를 도구로 만들 수 있을까?

    # 강변에서 있었던 일을 수나에게 말해 주는 주인공
    # 전력-마력 변환기를 돌판 같은 곳에 새길 수 있을지 연구하자는 수나
    # 이건 주인공이 도와 줄 방법이 없음. 마냥 기다려야 함

    return

