label hiddenEnding(forcePlay = False):

    if builditTesting and (not forcePlay):
        return

    수나 "연산회로 42억 9496만 7296개를 병렬 연결해 후작이 돌아갈 시공간 좌표를 특정할 수 있었도다."
    수나 "내 우화가 임박했노라. 우화한 이후라면 내 마력도 충분히 성장할 것이니라. 그럼 돌려보내 줄 수 있도다."
    수나 "7일만 기다리거라."

    독백 "7일 후 내 귀환을 준비하는 수나 공주."
    원화 "멈추어라."
    수나 "어마마마?"
    주인공 "폐하? 여긴 어쩐 일이신지……."
    원화 "내 그간 후작의 행적을 계속 지켜보았다네."
    원화 "그 결과, 자네를 그냥 보낼 수는 없다는 결론을 내렸지."
    주인공 "아니……. 말씀이 다르지 않습니까?"
    원화 "자네에게 해가 되는 일은 아닐세. 그러니 마음 놓게나."
    독백 "처음 별천지에 왔을 때처럼 내 몸이 결박되었다."
    주인공 "이게 무슨……?"

    원화 "너희들도 모두 따라오너라."
    독백 "수나와 시녀 일행까지 모두 결박한 채 공중에 둥둥 띄워 침실로 향하는 폐하."
    독백 "뭐야? 도대체 무슨 일이 벌어지는 거야?"
    독백 "침실에 도착하자 내 몸이 침대 위에 묶인 채 옷이 모두 벗겨졌다."
    주인공 "폐하?"
    원화 "건장하고도 탐스러운 몸이로다."
    독백 "폐하께서 옷을 모두 벗어던지고 내 위에 올라탔다."
    원화 "내가 후작을 가지겠다."
    주인공 "폐하! 이러시면 안 됩니다."
    원화 "별천지의 모든 신민은 짐의 것. 당연히 된다네."
    주인공 "살려 주세요, 폐하!"
    원화 "안 죽는다는 사실을 이미 알고 있네만……."

    # 건버드2 패러디 신
    주인공 "내… 내 처음이……."
    원화 "상쾌하도다. 내 생애에 다시 남자를 맛볼 날이 오다니……."
    원화 "이 아름다운 여성들을 보고도 음욕이 전혀 없어 보이는 후작을 의심했다만……."
    원화 "다들 보았느냐? 후작의 남성 기능은 왕성하기 그지없노라."
    주인공 "으흑……."
    원화 "후작. 왜 우는가? 마치 마법총에 맞은 새처럼……."
    원화 "자네의 마음에 드는 여인 50명을 취하게나. 그러면 제국의 인구도 늘고 세력도 막강해질 터."
    원화 "그 이후에 지구로 돌려보내 주겠네."
    "(엔딩 크레딧)"

    return
