label trueEnding(forcePlay = False):

    if builditTesting and (not forcePlay):
        return

    수나 "연산회로 42억 9496만 7296개를 병렬 연결해 후작이 돌아갈 시공간 좌표를 특정할 수 있었도다."
    수나 "내 우화가 임박했노라. 우화한 이후라면 마력도 충분히 성장할 것이니라. 그럼 돌려보내 줄 수 있다만……."
    수나 "후작. 정말 떠나야겠느냐?"
    주인공 "응. 여기 사는 것도 좋지만 내 고향은 아닌걸."
    수나 "히잉……."
    수나 "후작. 내가 후작을 소환했으니, 후작은 내 권속이니라. 주인의 명령을 거역하는 권속이 어디 있단 말이냐?"
    수나 "시녀들도 전부 후작과 헤어지길 싫어한단 말이다."
    # (떠나지 말라는 어거지 + 서운하지만 돌아가고 싶은 승태)
    주인공 "나도 여기가 좋아. 하지만 내 본래 삶은 지구에 있어."
    수나 "밉다, 후작. 물러나라."

    독백 "7일 동안 수나의 모습을 볼 수 없었다."
    독백 "슬슬 불안해진다. 안 돌려보내 주면 못 가니까 이대로 나를 잡아 두려고 하나?"
    독백 "아니면 내 얼굴이 보기 싫어졌나?"
    독백 "별의별 망상을 떠올리며 방에 앉아 있는데 로잘린드가 들어왔다."
    로잘린드 "주인님. 공주님께서 찾으십니다."

    독백 "로잘린드의 안내를 받아 간 곳에는 거대한 고치가 있었다."
    독백 "이건?"
    로잘린드 "여기서 잠깐 기다려 주시길……."
    독백 "곧 고치가 열리고 성인 여성 한 명이 웅크린 채 나타났다."
    독백 "설마?"
    로잘린드 "다시 뵙겠습니다, 수나 공주님!"
    독백 "정말 수나였구나."
    로잘린드 "옷을 준비해 두었습니다."
    
    수나 "후작. 나는 후작과 헤어지기도 싫고, 그렇다고 약속을 어길 수도 없었노라."
    수나 "그래서, 내가 후작을 가지기로 했노라."
    주인공 "그게 무슨 말이야?"
    수나 "곧 알게 될 것이니라. 먼저 가서 기다리거라."
    수나 "번개나무로 가자꾸나. 차원 전이 마법을 수행할 것이니라."

    # ......

    독백 "별천지로 올 때처럼 거대한 힘이 내 몸을 끌어당긴다."

    독백 "눈을 떠 보니 내 자취방 앞이었다. 문도 그대로 열려 있었다."
    독백 "이크. 지금 바로 나가지 않으면 지각하겠다. 즉시 학교로 뛰었다."

    scene college with dissolve

    독백 "수업이 끝났다."
    독백 "별천지에서 있었던 일이 꿈만 같다. 아니, 정말 꿈이었나?"
    독백 "집으로 가려 학교 건물을 나왔다."

    주인공 "어?"
    독백 "하늘에 시커먼 구멍이 뚫렸다."
    독백 "그 구멍에서 낯익은 여성 일곱 명이 날아 내려왔다."
    수나 "여기가 지구로구나."
    주인공 "수나!"
    수나 "후작! 말했던대로 후작을 가지러 왔노라."

    "(뉴스속보) 오늘 XX대학 상공에서 차원문이 열리고, 이세계의 존재들이 나타났습니다."
    "(뉴스속보) 그 중 우두머리로 보이는 여성은 자신을 별천지의 ‘수나 공주’라 소개하며 대통령과 면담을 청하고 있습니다."

    독백 "6개월이 물 흐르듯 지나갔다."
    독백 "수나와 시녀들은 별천지에서 가져온 마법 물품을 팔아 막대한 돈을 마련했다."
    독백 "정부에서는 정부청사와 도시 여러 곳을 연결하는 차원문 교통망을 구축하는 5개년 계획을 수립했다."
    독백 "출퇴근을 쉽게 하고 지역 격차를 해소한다는 명목이었다. 덕분에 차원문과 번개나무를 대량으로 판매할 수 있었다."
    독백 "그 동안 수나는 정부와 협상해 우리 여덟 명이 살아갈 자치령을 얻어냈다."
    독백 "내 명의로 땅을 구매하고, 그 땅에 지구와 별천지 대사관을 설립하는 형식이었다."
    독백 "마침내 대사관 준공이 완료되는 날이 왔다."

    scene unitednation with dissolve

    수나 "저희들에게 새로운 시야를 틔워 준 지구인 여러분께 감사드립니다."
    수나 "앞으로 지구의 과학기술과 별천지의 마법이 조화를 이루어 상호 발전해나가기를 기원합니다."
    수나 "지구와 별천지 간 우호를 다질 기회가 생겨 기쁘게 생각합니다."

    scene unitednation with fadeoutin

    수나 "어떠냐, 나 멋있었느냐?"
    독백 "침착한 척 하고 있지만 의기양양한 표정에 날개를 계속 파닥거리고 있다."
    독백 "칭찬받고 싶은가? 머리를 쓰다듬어 주었다."
    주인공 "응. 멋있었어. 새삼 네가 공주란 사실을 실감했지."
    수나 "후후. 오늘은 특별히 내 머리를 허락하겠노라."
    수나 "드디어, 우리가 합법적으로 지구에서 지낼 기반을 마련했도다."
    수나 "그간 이 날을 얼마나 기다렸는지 아느냐?"

    scene hotelpool with dissolve

    주인공 "여의도 크기의 땅에 호텔과 풀장이 딸린 대사관이라……."
    주인공 "통이 너무 큰 거 아냐?"
    수나 "가능만 하다면 나라 하나를 통째로 사서 후작에게 주고 싶은 심정이니라."
    주인공 "나에게 과분하지 않은가 싶어서 말이지."
    수나 "부담 놓거라. 대출 형식이니 평생 갚아야 하느니라."
    주인공 "이 정도면 평생 대출금만 갚아도 모자라겠는데?"
    수나 "그쯤은 돼야 후작의 코를 단단히 꿰어 놓을 수 있느니라. 오홋홋홋홋!"
    독백 "크! 저 웃음. 다시 들으니 감회가 새롭다고 해야 하나?"
    수나 "안아 다오. 방으로 가자꾸나. 이제 후작을 온전히 내 것으로 만들겠노라."
    독백 "수나를 안아 들고 호텔 방으로 들어왔다."

    scene suna_sex01
    # 수나 H신 메뉴 구현
    수나 "이것이, 하나가 된다는 느낌이로구나."
    수나 "너무나 좋았노라."
    주인공 "나 역시……."
    수나 "이 곳, 지구에 우리들의 새 터전을 일굴 것이니라."
    수나 "우리들의 아이를 낳고, 마법과 과학을 덧붙여 새로운 경지를 이루고……."
    수나 "우리들만의 별천지를 만들어 갈 것이니라."
    수나 "또 가능하겠느냐?"
    주인공 "물론."
    수나 "나는 공주이니라. 어마마마를 제외한 그 누구도 내 위에 있지는 못하리니……."
    수나 "누워 있거라. 이번에는 내가 이끌어 주마."

    scene suna_sex02
    "(엔딩 크레딧)"

    return
